import 'package:pskov_bus_5/stopClass.dart';


class StopList {


  List <Stop> stopsList = [
    Stop("10 Школа от дамбы", 118, [6, 16]),
    Stop("10 Школа к дамбе ", 117, [6, 16]),
    Stop("12 Школа в центр", 39, [5, 11, 22, 30]),
    Stop("12 Школа из центра", 40, [ 11, 22, 30]),
    Stop("Алехина ул. в центр", 4, [1, 16,118]),
    Stop("Алехина ул. из центра", 5, [1, 16,118]),
    Stop("Алмазная ул. к мосту ",183, [16, 22]),
    Stop("Алмазная ул. от моста ",184, [16, 22]),
    Stop("Архив", 33, [5, 11, 22, 23, 25, 30]),
    Stop("Балтийская", 303, [17]),
    Stop("Балтийская ул. (школа 27) ", 302, [2]),
    Stop("Белинского ул.", 38, [11, 22, 30]),
    Stop("Белый мох в город", 209, [9]),
    Stop("Ваулино в город", 240, [124]),
    Stop("Венская в город ", 323, [25]),
    Stop("Виадук к вокзалу ", 155, [14, 23]),
    Stop("Виадук от вокзала ", 154, [14, 23]),
    Stop("Вокзал", 31, [ 1, 2, 5, 6, 8, 9, 11, 12, 14, 116, 16, 17, 23]),
    Stop("Вокзал в Череху", 123, [ 6]),
    Stop("Гагарина ул. в центр ", 29, [ 1, 4, 14, 17, 116]),
    Stop("Гагарина ул. к вокзалу ", 28, [1, 4, 9, 12, 14, 17, 116]),
    Stop("Гагарина ул. (Фабрициуса) ", 47, [2, 5, 6, 11, 16]),
    Stop("Городская больница к центру ", 149, [ 14]),
    Stop("Городская больница от центра ", 150, [ 14]),
    Stop("Горького ул. ", 62, [3, 4, 14,  17,118, 22, 25, 30,116,124]),
    Stop("Гражданская ул. от вокзала ", 44,  [8, 11, 19]) ,
    Stop("Гражданская ул.  ", 43,  [11]),
    Stop("Дамба от моста ", 76,   [2, 5]),
    Stop("Дамба к мосту ", 75,    [2, 5, 8, 19]),
    Stop("Детская обл. больница к центру", 147,   [14]),
    Stop("Детская обл. больница от центра ", 148,   [14]),
    Stop("Детский парк к пл.Ленина", 23,[1, 3, 4, 8, 11, 14, 17, 116]),
    Stop("Детский парк к вокзалу", 22,[1, 3, 4, 5, 8, 11, 14, 17, 116]),
    Stop("Дом офицеров от дамбы ", 122, [6, 16, 19]),
    Stop("Дом офицеров к дамбе ", 121, [6, 16, 19]),
    Stop("Западная ", 65, [  17, 22, 30,116,124]),
    Stop("Звездная",  35, [5, 11, 22, 23, 25, 30]),
    Stop("Ижорского бат-на в центр", 8, [1, 22,118]),
    Stop("Ижорского бат-на из центра",  9, [1, 22,118]),
    Stop("Инженерная в город",  175,  [3]),
    Stop("Ипподромная в центр (25маршрут) ", 237, [25]),
    Stop("Ипподромная из центра (25маршрут) ",  236,  [25]),
    Stop("Ипподромная в центр ( Индустриальная ) ", 173,    [3]),
    Stop("Ипподромная из центра ( Индустриальная ) ", 172,  [3, 5]),
    Stop("Колокольная в центр", 2, [1, 16]),
    Stop("Колокольная из центра", 3,    [1, 16]),
    Stop("Коммунальная в центр",  54, [2, 3, 4, 6, 16, 17, 22, 25, 30,118]),
    Stop("Коммунальная к Чудской", 185,  [16, 22]),
    Stop("Корытово в центр", 86,  [8]),
    Stop("Кошевого ул. в центр ",18,   [1, 25,118, 124]),
    Stop("Кошевого ул. из центра ", 19,  [1, 25, 118,124]),
    Stop("Кресты в центр", 113,  [4, 9, 12]),
    Stop("Кресты из центра",  112,  [4, 9, 12]),
    Stop("Ледовый дворец", 305,  [17]),
    Stop("Ледовый дворец из центра ", 304,   [2]),
    Stop("Ленина пл. ДКП", 21,  [1, 11, 22, 25, 30,118, 124]),
    Stop("Ленина пл. кт.Октябрь", 64, [3, 4, 5, 8, 14,  17,19, 22, 25, 30,116,118,  124]),
    Stop("Ленина пл. Кремль", 20, [1, 11]),
    Stop("Ленина пл. Сбербанк", 63, [3, 4, 5, 14, 17, 116]),
    Stop( "Летний Сад от вокзала", 25, [1, 3, 4, 8, 11, 14, 17, 116]),
    Stop("Летний Сад к вокзалу", 24, [1, 4, 11, 14, 17, 116]),
    Stop("Летний сад (Кузнецкая ул.) ", 171, [3, 5]),
    Stop("Льнокомбинат в центр",  12, [1,118]),
    Stop("Льнокомбинат из центра", 13, [1,118]),
    Stop("Люксембург Р. ул. ", 170, [2]),
    Stop("Маяк от центра", 59,  [2, 3, 4,17,   22, 25, 30,116,118,124,]),
    Stop("Маяк в центр", 58, [2, 3, 4,  17,22, 25, 30,116, 118,124, ]),
    Stop("Мебельный магазин ",  167, [2]),
    Stop("Металлистов ул. в центр ",  27, [1, 4, 14, 17 ,116]),
    Stop("Металлистов ул. к вокзалу", 26, [1, 4, 14,  17,116]),
    Stop("Мясокомбинат в центр",  14, [1, 118,124]),
    Stop("Мясокомбинат из центра ",  15, [1, 118,124]),
    Stop("Народная от дамбы ", 120, [6, 16, 19]),
    Stop("Народная к дамбе ", 119, [6, 16, 19]),
    Stop("Невского в центр", 16, [1, 25,118, 124]),
    Stop("Невского из центра ", 17,  [1, 25,118,124]),
    Stop("Новоселов ул. ", 34,  [5, 11, 22, 23, 25, 30]),
    Stop("Обл.Больница от Дамбы",  72, [2, 5]),
    Stop("Обл.Больница к Дамбе", 71,  [2, 5, 8, 19]),
    Stop("Овсище в центр", 6,  [1, 16,118]),
    Stop("Овсище из центра",  7,  [1, 16,118]),
    Stop("Петровская в центр", 60, [2, 3, 4,  17,22, 25, 30, 116,118, 124,]),
    Stop("Петровская ул. из центра ", 61, [3, 4, 17, 22, 25, 30, 116,118,124 ]),
    Stop("Храм Жен Мироносиц в центр ", 151, [14]),
    Stop("Храм  Жен Мироносиц из центра  ", 152, [14]),
    Stop("Печорская", 50,   [2, 3, 4, 6, 14, 17, 22, 25, 30,118]),
    Stop("Печорская тк.Гулливер ", 51,   [2, 3, 4, 6, 14, 25,118]),
    Stop("Писковичи в город", 295,    [118]),
    Stop("Пл.Победы вечный огонь", 102,    [2, 6, 16]),
    Stop("Пл.Победы ГПТУ1", 101,  [2, 6, 8, 16, 19]),
    Stop("Политехнический колледж", 191,  [22]),
    Stop("Псковкирпич", 219,   [12]),
    Stop("Псковпищепром в центр ", 235,    [25]),
    Stop("Псковпищепром из центра ", 234,    [25]),
    Stop("Пчеловод", 166,    [14]),
    Stop("Рижский микрорайон", 69,   [2,22,25,30]),
    Stop("Рижский пр. от дамбы ", 116,   [6, 16]),
    Stop("Рижский пр. к дамбе ", 115,    [6, 16]),
    Stop("Рижское шоссе ", 256,    [ 17, 25,116, 124]),
    Stop("Рижское шоссе в город ", 255,   [2,25,116, 124]),
    Stop("Родина",  275,  [25]),
    Stop("Рокоссовского ул.",48, [2, 3, 4, 6, 14, 17, 22, 25, 30,118]),
    Stop("Рокоссовского ул. из центра ", 49, [2, 3, 4, 6, 14, 25]),
    Stop("Северная", 32,  [1,118]),
    Stop("Снятная Гора", 301,  [1, 16]),
    Stop("Советской армии ул. в центр ", 126,  [6]),
    Stop("Советской армии ул. из центра ", 127,   [6]),
    Stop("Текстильная ул. в центр ", 36, [5, 11, 22, 30]),
    Stop("Текстильная ул. из центра ",  37,  [11, 22, 23, 25, 30]),
    Stop("Телецентр",  68, [  17, 22, 30,116,124]),
    Stop("Телецентр в город ", 67, [116, 124]),
    Stop("Торговый дом в центр ",52, [2, 3, 4, 6, 14, 17, 22, 25, 30,118]),
    Stop("Торговый дом из центра ", 53, [2, 3, 4, 6, 14, 25,118]),
    Stop("Торговый центр от вокзала", 46, [2, 5, 6, 11, 16]),
    Stop("Торговый центр к вокзалу", 45, [2, 5, 6, 11, 16]),
    Stop("Труда ул. в центр ", 41, [5, 11, 22, 30]),
    Stop("Труда ул. из центра ", 42,  [11, 22, 30]),
    Stop("Тямша в город ", 270, [116]),
    Stop("Универмаг ", 57,  [2, 3, 4, 17, 22, 25, 30,116,118,124]),
    Stop("Учхоз в город ",  232,  [4, 12]),
    Stop("Храм Невского от дамбы ", 74,  [2, 5]),
    Stop("Храм Невского к дамбе ",  73,   [2, 5, 8, 19]),
    Stop("Цементный склад", 190,    [19]),
    Stop("Центральная Гор.Библиотека ", 70,  [2, 5, 8, 19]),
    Stop("Череха в центр", 142,  [6]),
    Stop("Чудская в центр", 10,   [1, 22,118]),
    Stop("Чудская из центра", 11,   [1, 22,118]),
    Stop("Энтузиастов пр. в центр ", 239,   [25]),
    Stop("Энтузиастов пр. из центра", 238,   [25]),
    Stop("Юбилейная в центр", 55, [2, 3, 4,  17, 22, 25, 30,116,118, 124]),
    Stop("Юбилейная из центра ",56 , [2, 3, 4,  17, 22, 25, 30,116, 118,124]),
  ];


  List <String> getNames() {
    List <String> names = [];
    for (int i = 0; i < stopsList.length; i++) {
      names.add(stopsList[i].name.toString());
    }
    return names;
  }

  String getName(int id){
    String name="";
    for (int i=0;i<stopsList.length;i++){
      if (stopsList[i].id==id){
        name=stopsList[i].name.toString();
      }
    }
   // print("from getName(id):    $name");
    return name;
  }



  List <String> getRoutes() {
    List <String> routes = [];
    for (int i = 0; i < stopsList.length; i++) {
      var routesInString = "маршруты: ";

           for (var item in stopsList[i].routes) {
        routesInString += item.toString();
        routesInString += ", ";
             }
      routes.add(routesInString);
    }
    return routes;
  }

String getRoutesForOne(int id){
    String routes="";
  for (int i = 0; i < stopsList.length; i++){
    if(stopsList[i].id==id){
      routes=stopsList[i].routes.toString();
    }
  }
    return routes;
}


  int getId(index) {
    int id;
    id = stopsList[index].id!;
    return id;
  }


}



